## Dev Plan - Challenge 2
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.ncaa_s3_read_only will be created
  + resource "aws_iam_policy" "ncaa_s3_read_only" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Read-only access to NCAA S3 bucket"
      + id               = (known after apply)
      + name             = "ncaa-s3-read-only"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
        }
    }

  # aws_iam_policy.ncaa_s3_read_write will be created
  + resource "aws_iam_policy" "ncaa_s3_read_write" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Read/write access to NCAA S3 bucket"
      + id               = (known after apply)
      + name             = "ncaa-s3-read-write"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
        }
    }

  # aws_iam_role.ncaa_data_writer will be created
  + resource "aws_iam_role" "ncaa_data_writer" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ncaa-data-writer"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.ncaa_data_writer_read_write will be created
  + resource "aws_iam_role_policy_attachment" "ncaa_data_writer_read_write" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ncaa-data-writer"
    }

  # aws_iam_user.ncaa_analyst will be created
  + resource "aws_iam_user" "ncaa_analyst" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "ncaa-analyst"
      + path          = "/"
      + tags_all      = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
        }
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.ncaa_analyst_read_only will be created
  + resource "aws_iam_user_policy_attachment" "ncaa_analyst_read_only" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "ncaa-analyst"
    }

  # aws_s3_bucket.ncaa will be created
  + resource "aws_s3_bucket" "ncaa" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "ncaa"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_policy.ncaa_enforce_encryption will be created
  + resource "aws_s3_bucket_policy" "ncaa_enforce_encryption" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```